; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v10 ?v1)
             (pred_6 ?v6 ?v8)
             (pred_2 ?v10 ?v8)
             (pred_10 ?v3 ?v10 )
	     (pred_11 ?v10)
             (pred_8 ?v11)
             (pred_5 ?v6)
             (pred_4 ?v8)
             (pred_12 ?v10)
             (pred_3 ?v6)
             (pred_7 ?v10)
             (pred_9 ))



(:action op_1
:parameters (?v2 ?v12 ?v9 ?v4)
:precondition (and (pred_8 ?v2) (pred_8 ?v12) (pred_5 ?v9) (pred_4 ?v4)
          (pred_1 ?v2 ?v12) (pred_6 ?v9 ?v4)
                   (pred_2 ?v12 ?v4) (pred_11 ?v2) 
                   (pred_12 ?v12) (pred_3 ?v9))
:effect (and  (pred_7 ?v12) (not (pred_12 ?v12))))


(:action op_3
:parameters (?v2 ?v13)
:precondition (and (pred_8 ?v2) (pred_8 ?v13)
               (pred_11 ?v2) (pred_1 ?v2 ?v13) (pred_7 ?v13))
:effect (and (pred_11 ?v13) (not (pred_11 ?v2))))

(:action op_5
:parameters (?v2 ?v9)
:precondition (and (pred_8 ?v2) (pred_5 ?v9) 
                  (pred_11 ?v2) (pred_10 ?v9 ?v2) (pred_9 ))
:effect (and (pred_3 ?v9)
   (not (pred_10 ?v9 ?v2)) (not (pred_9 ))))


(:action op_2
:parameters (?v2 ?v7 ?v5)
:precondition (and (pred_8 ?v2) (pred_5 ?v7) (pred_5 ?v5)
                  (pred_11 ?v2) (pred_3 ?v5) (pred_10 ?v7 ?v2))
:effect (and (pred_3 ?v7) (pred_10 ?v5 ?v2)
        (not (pred_3 ?v5)) (not (pred_10 ?v7 ?v2))))

(:action op_4
:parameters (?v2 ?v9)
:precondition (and (pred_8 ?v2) (pred_5 ?v9) 
                  (pred_11 ?v2) (pred_3 ?v9))
:effect (and (pred_9 ) (pred_10 ?v9 ?v2) (not (pred_3 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_05 obj_06 obj_20 obj_01 obj_07 obj_19 obj_14 obj_16 obj_02 obj_10 obj_12 obj_15 obj_08 obj_17 obj_11 obj_13
    obj_04 obj_09
    obj_18 obj_03
    )

    (:init
       (pred_9)

       (pred_8 obj_05)
       (pred_8 obj_06)
       (pred_8 obj_20)
       (pred_8 obj_01)
       (pred_8 obj_07)
       (pred_8 obj_19)
       (pred_8 obj_14)
       (pred_8 obj_16)
       (pred_8 obj_02)
       (pred_8 obj_10)
       (pred_8 obj_12)
       (pred_8 obj_15)
       (pred_8 obj_08)
       (pred_8 obj_17)
       (pred_8 obj_11)
       (pred_8 obj_13)
       (pred_4 obj_04)
       (pred_4 obj_09)
       (pred_5 obj_18)
       (pred_5 obj_03)

       (pred_1 obj_05 obj_07)
       (pred_1 obj_05 obj_06)
       (pred_1 obj_06 obj_19)
       (pred_1 obj_06 obj_20)
       (pred_1 obj_06 obj_05)
       (pred_1 obj_20 obj_14)
       (pred_1 obj_20 obj_01)
       (pred_1 obj_20 obj_06)
       (pred_1 obj_01 obj_16)
       (pred_1 obj_01 obj_20)
       (pred_1 obj_07 obj_02)
       (pred_1 obj_07 obj_19)
       (pred_1 obj_07 obj_05)
       (pred_1 obj_19 obj_10)
       (pred_1 obj_19 obj_14)
       (pred_1 obj_19 obj_06)
       (pred_1 obj_19 obj_07)
       (pred_1 obj_14 obj_12)
       (pred_1 obj_14 obj_16)
       (pred_1 obj_14 obj_20)
       (pred_1 obj_14 obj_19)
       (pred_1 obj_16 obj_15)
       (pred_1 obj_16 obj_01)
       (pred_1 obj_16 obj_14)
       (pred_1 obj_02 obj_08)
       (pred_1 obj_02 obj_10)
       (pred_1 obj_02 obj_07)
       (pred_1 obj_10 obj_17)
       (pred_1 obj_10 obj_12)
       (pred_1 obj_10 obj_19)
       (pred_1 obj_10 obj_02)
       (pred_1 obj_12 obj_11)
       (pred_1 obj_12 obj_15)
       (pred_1 obj_12 obj_14)
       (pred_1 obj_12 obj_10)
       (pred_1 obj_15 obj_13)
       (pred_1 obj_15 obj_16)
       (pred_1 obj_15 obj_12)
       (pred_1 obj_08 obj_17)
       (pred_1 obj_08 obj_02)
       (pred_1 obj_17 obj_11)
       (pred_1 obj_17 obj_10)
       (pred_1 obj_17 obj_08)
       (pred_1 obj_11 obj_13)
       (pred_1 obj_11 obj_12)
       (pred_1 obj_11 obj_17)
       (pred_1 obj_13 obj_15)
       (pred_1 obj_13 obj_11)
       (pred_12 obj_07)
       (pred_12 obj_15)
       (pred_2  obj_07 obj_04)
       (pred_2  obj_15 obj_09)
       (pred_7 obj_05)
       (pred_7 obj_06)
       (pred_7 obj_20)
       (pred_7 obj_01)
       (pred_7 obj_19)
       (pred_7 obj_14)
       (pred_7 obj_16)
       (pred_7 obj_02)
       (pred_7 obj_10)
       (pred_7 obj_12)
       (pred_7 obj_08)
       (pred_7 obj_17)
       (pred_7 obj_11)
       (pred_7 obj_13)

       (pred_6  obj_18 obj_04)
       (pred_6  obj_03 obj_09)
       (pred_10 obj_18 obj_12)
       (pred_10 obj_03 obj_02)
       (pred_11 obj_11)
    )

    (:goal (and
       (pred_10 obj_03 obj_08)
    ))
(:constraints
  (always (not (pred_11 obj_17)))
)
)

; plan
1. (op_3 obj_11 obj_12)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_12)
   goals met: 0 of 1
2. (op_3 obj_12 obj_10)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_10)
   goals met: 0 of 1
3. (op_3 obj_10 obj_02)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_02)
   goals met: 0 of 1
4. (op_5 obj_02 obj_03)
   deleted: (pred_10 obj_03 obj_02) (pred_9)
   added: (pred_3 obj_03)
   goals met: 0 of 1
5. (op_3 obj_02 obj_08)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_08)
   goals met: 0 of 1
6. (op_4 obj_08 obj_03)
   deleted: (pred_3 obj_03)
   added: (pred_9) (pred_10 obj_03 obj_08)
   goals met: 1 of 1
